/**
 * Created by Виталий on 21.09.2016.
 */
/**
 * так-с ну что:
 * 
 * сделать тесты
 * 
 * у меня много повторяющегося кода, его нужно вынести в отдельный модуль и подключать, например
 * папка Student_progress
 * 
 * сделать отдельный модуль подключения бд
 *
 * Важно: он не воспринимает регистр в моделях бд
 *
 * atd stack стэк на самом низшем уровне
 * интерфейс на разных реализациях
 * решение прикладной задачи------7
 *
 * структура
 * определение интерфейса абстрактного метода
 * варианты реализации
 * результаты тестов
 * решение прикладной задачи
 *
 */